tap "homebrew/services"
tap "thoughtbot/formulae"
tap "neovim/neovim"
tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
tap 'dral3x/dral3x'

tap 'caskroom/fonts'
tap 'caskroom/drivers'

# Git formulas
brew "git"
brew "hub"
brew 'git-extras'
brew 'git-lfs'
brew "tig"
brew "libgit2"
brew "openssl"

# GPG stuff
brew 'gnupg2'
brew 'gpg-agent'
brew 'pinentry-mac'

# Tools
brew "zsh"
brew 'bash'
brew 'fish'
brew 'wget', args: ['with-iri']
brew 'ack'
brew 'neovim'
brew 'jq'
brew 'httpie'
brew 'youtube-dl'
brew 'rcm'
brew 'trash'
brew 'mas'
brew 'binutils'
brew 'redis'
brew 'exa'
brew 'gnu-sed', args: ['with-default-names']
brew 'fd'
brew 'tokei'
brew 'awscli'
brew 'coreutils'
brew 'rename'

# Languages
brew 'carthage'
brew 'artemnovichkov/projects/carting'
brew 'rbenv'
brew 'ruby-build'
brew 'yarn'
brew 'ctags'
brew 'fzf'
brew 'burntsushi/ripgrep/ripgrep-bin'
brew 'z'
brew 'editorconfig'
brew 'gifsicle'
brew 'imagemagick'
brew 'ffmpeg', args: [
  'with-fdk-aac', 
  'with-sdl2', 
  'with-freetype',
  'with-libass',
  'with-libquvi',
  'with-libvorbis',
  'with-libvpx',
  'with-opus',
  'with-x265'
]
brew 'pngcrush'
brew 'reattach-to-user-namespace'
brew 'tealdeer'

# Experiment
brew 'ccat'
brew 'zplug'
brew 'grc'
brew 'mp4v2'

# Swift/Xcode tooling
brew 'swiftplate'
brew 'swiftlint'
brew 'stringslint'

### Casks ###
cask 'alfred'
cask 'bartender'
cask 'font-iosevka'
cask 'imageoptim'
cask 'paw'
cask 'spillo'
cask 'fork'
cask 'shortcat'
cask 'karabiner-elements'
cask 'dash'
cask 'spotify'
cask 'slack'
cask 'hazel'
cask 'the-unarchiver'
cask 'contexts'
cask 'itsycal'
cask 'tripmode'
cask 'viscosity'
cask 'hyper'
cask 'visual-studio-code'
cask 'iina'
cask 'gifs'
cask 'firefox'
cask 'google-chrome'
cask 'irccloud'
cask 'screens'
cask 'screens-connect'

### Media ###
cask 'forecast'

### Dev Specific ###
cask 'iterm2'
cask 'charles'
cask 'now'
cask 'postgres'
cask 'postico'
cask 'docker'

### Quicklook ###
cask 'qlvideo'
cask 'quicklook-json'

### MAS ###
mas '1Blocker', id: 1107421413
mas 'Deckset', id: 847496013
mas 'Deliveries', id: 924726344
mas 'Monosnap', id: 540348655
mas 'Reeder', id: 880001334
mas 'SnippetsLab', id: 1006087419
mas 'Bear', id: 1091189122
mas 'Giphy Capture', id: 668208984
mas 'Clearview', id: 557090104
mas 'Moom', id: 419330170
mas 'Twitterrific', id: 1289378661
mas 'Spark', id: 1176895641
mas 'Pocket', id: 568494494
mas 'Gifski', id: 1351639930
mas "iRamDisk", id: 492615400
