tap "homebrew/services"
tap "thoughtbot/formulae"
tap "neovim/neovim"
tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
tap "uptech/homebrew-oss"
tap 'getsentry/tools'
tap 'yqrashawn/goku'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'

# Git formulas
brew "git"
brew "hub"
brew 'git-extras'
brew 'git-lfs'
brew "tig"
brew "libgit2"
brew "openssl"

# GPG stuff
brew 'gnupg2'
brew 'pinentry-mac'

# Package Manager
brew 'mas'
brew 'carthage'
brew 'luarocks'

# Languages
brew 'rbenv'
brew 'ruby-build'
brew 'stack'
brew 'go'
brew 'lua'

# Shells
brew "zsh"
brew 'bash'
brew 'fish'

# Tools
brew 'tmux'
brew 'cmake'
brew 'wget'
brew 'ack'
brew 'neovim'
brew 'jq'
brew 'httpie'
brew 'youtube-dl'
brew 'trash'
brew 'binutils'
brew 'redis'
brew 'exa'
brew 'gnu-sed'
brew 'fd'
brew 'awscli'
brew 'coreutils'
brew 'rename'
brew 'uptech/oss/alt'
brew 'hexyl'
brew 'ctags'
brew 'fzf'
brew 'burntsushi/ripgrep/ripgrep-bin'
brew 'z'
brew 'editorconfig'
brew 'gifsicle'
brew 'imagemagick'
brew 'ffmpeg'
brew 'pngcrush'
brew 'reattach-to-user-namespace'
brew 'tealdeer'
brew 'yqrashawn/goku/goku', restart_service: :changed
brew 'yarn'
brew 'ccat'
brew 'grc'
brew 'mp4v2'
brew 'getsentry/tools/sentry-cli'

# Swift/Xcode tooling
brew 'mint'
brew 'swiftformat'
brew 'swiftlint'
brew 'swiftplate'

### Casks ###
cask 'alfred'
cask 'bartender'
cask 'font-iosevka'
cask 'imageoptim'
cask 'paw'
cask 'spillo'
cask 'fork'
cask 'karabiner-elements'
cask 'dash'
cask 'hazel'
cask 'the-unarchiver'
cask 'contexts'
cask 'itsycal'
cask 'tripmode'
cask 'viscosity'
cask 'hyper'
cask 'visual-studio-code'
cask 'gifs'
cask 'firefox'
cask 'google-chrome'
cask 'irccloud'
cask 'screens'
cask 'screens-connect'
cask 'keycastr'

### New ###
cask 'istat-menus'
cask 'intel-power-gadget'

### Media ###
cask 'spotify'
cask 'iina'

### Dev Specific ###
cask 'hammerspoon'
cask 'iterm2'
cask 'charles'
cask 'now'
cask 'postgres'
cask 'postico'
cask 'docker'
cask 'iconizer'
cask 'swiftformat-for-xcode'

### Quicklook ###
cask 'qlvideo'
cask 'quicklook-json'
cask 'webpquicklook'

### MAS ###
mas '1Blocker', id: 1107421413
mas 'Deckset', id: 847496013
mas 'Deliveries', id: 924726344
mas 'Monosnap', id: 540348655
mas 'SnippetsLab', id: 1006087419
mas 'Bear', id: 1091189122
mas 'Giphy Capture', id: 668208984
mas 'Clearview', id: 557090104
mas 'Moom', id: 419330170
mas 'Twitterrific', id: 1289378661
mas 'Spark', id: 1176895641
mas 'Pocket', id: 568494494
mas 'Gifski', id: 1351639930
mas 'Save to Pocket', id: 1477385213
mas 'NepTunes', id: 1006739057
