tap 'homebrew/services'
tap 'thoughtbot/formulae'
tap 'neovim/neovim'
tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
tap 'uptech/homebrew-oss'
tap 'getsentry/tools'
tap 'yqrashawn/goku'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'

# Git formulas
brew 'git'
brew 'hub'
brew 'git-extras'
brew 'git-delta'
brew 'tig'
brew 'openssl'

# GPG stuff
brew 'gnupg2'
brew 'pinentry-mac'

# Package Manager
brew 'mas'
brew 'carthage'
brew 'luarocks'

# Languages
brew 'rbenv'
brew 'ruby-build'
brew 'go'
brew 'lua'

# Shells
brew 'fish'

# Tools
brew 'tmux'
brew 'wget'
brew 'ack'
brew 'neovim'
brew 'jq'
brew 'httpie'
brew 'youtube-dl'
brew 'trash'
brew 'binutils'
brew 'redis'
brew 'gnu-sed'
brew 'awscli'
brew 'coreutils'
brew 'rename'
brew 'uptech/oss/alt'
brew 'hexyl'
brew 'ctags'
brew 'fzf'
brew 'burntsushi/ripgrep/ripgrep-bin'
brew 'editorconfig'
brew 'gifsicle'
brew 'imagemagick'
brew 'pngcrush'
brew 'reattach-to-user-namespace'
brew 'tealdeer'
brew 'yqrashawn/goku/goku', restart_service: :changed
brew 'yarn'
brew 'grc'
brew 'mp4v2'
brew 'getsentry/tools/sentry-cli'
brew 'bat'

# Swift/Xcode tooling
brew 'mint'
brew 'swiftformat'
brew 'swiftlint'
brew 'swiftplate'

### Casks ###
cask 'alfred'
cask 'font-victor-mono'
cask 'font-iosevka'
cask 'imageoptim'
cask 'spillo'
cask 'fork'
cask 'karabiner-elements'
cask 'dash'
cask 'hazel'
cask 'itsycal'
cask 'tripmode'
cask 'visual-studio-code'
cask 'gifs'
cask 'firefox'
cask 'google-chrome'
cask 'keycastr'

### Media ###
cask 'iina'

### Dev Specific ###
cask 'syncthing'
cask 'hammerspoon'
cask 'charles'
cask 'now'
cask 'postgres'
cask 'postico'
cask 'docker'
cask 'iconizer'
cask 'swiftformat-for-xcode'

### Quicklook ###
cask 'qlvideo'
cask 'quicklook-json'
cask 'webpquicklook'

### MAS ###
mas '1Blocker', id: 1_107_421_413
mas 'Deliveries', id: 924_726_344
mas 'Monosnap', id: 540_348_655
mas 'SnippetsLab', id: 1_006_087_419
mas 'Bear', id: 1_091_189_122
mas 'Clearview', id: 557_090_104
mas 'Twitterrific', id: 1_289_378_661
mas 'Spark', id: 1_176_895_641
mas 'Pocket', id: 568_494_494
mas 'Gifski', id: 1_351_639_930
mas 'Save to Pocket', id: 1_477_385_213

mas 'Key Codes', id: 414_568_915
mas 'RocketSim', id: 1_504_940_162
mas 'X-SwiftFormat', id: 1_509_655_496
mas 'Core Data Lab', id: 1_460_684_638
mas 'Popclip', id: 445_189_367
